report/xls/mysysbench.log
sysbench 1.0.19 (using bundled LuaJIT 2.1.0-beta2)

FATAL: Cannot find benchmark './tests/include/oltp_legacy/oltp.lua': no such built-in test, file or module
sysbench 1.0.19 (using bundled LuaJIT 2.1.0-beta2)

FATAL: Cannot find benchmark './tests/include/oltp_legacy/oltp.lua': no such built-in test, file or module
sysbench 1.0.19 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 10
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 10 tps: 3.30 qps: 78.16 (r/w/o: 56.07/7.60/14.49) lat (ms,95%): 6594.16 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 10 tps: 8.90 qps: 170.50 (r/w/o: 118.10/18.20/34.20) lat (ms,95%): 1352.03 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 10 tps: 8.00 qps: 167.51 (r/w/o: 119.31/16.70/31.50) lat (ms,95%): 1327.91 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 10 tps: 7.60 qps: 149.20 (r/w/o: 104.00/15.60/29.60) lat (ms,95%): 1678.14 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 10 tps: 8.00 qps: 159.20 (r/w/o: 110.60/17.30/31.30) lat (ms,95%): 1648.20 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 10 tps: 7.30 qps: 147.81 (r/w/o: 104.11/15.60/28.10) lat (ms,95%): 1506.29 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 10 tps: 8.20 qps: 158.90 (r/w/o: 110.50/17.00/31.40) lat (ms,95%): 1708.63 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 10 tps: 7.40 qps: 150.30 (r/w/o: 105.20/14.90/30.20) lat (ms,95%): 1771.29 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 10 tps: 7.90 qps: 160.49 (r/w/o: 113.29/16.40/30.80) lat (ms,95%): 1869.60 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 10 tps: 6.20 qps: 124.01 (r/w/o: 86.11/12.90/25.00) lat (ms,95%): 2585.31 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 10 tps: 7.30 qps: 146.60 (r/w/o: 103.30/15.80/27.50) lat (ms,95%): 1739.68 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 10 tps: 7.80 qps: 157.99 (r/w/o: 110.60/16.70/30.70) lat (ms,95%): 1506.29 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            12446
        write:                           1860
        other:                           3474
        total:                           17780
    transactions:                        889    (7.34 per sec.)
    queries:                             17780  (146.79 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          121.1278s
    total number of events:              889

Latency (ms):
         min:                                  970.97
         avg:                                 1354.60
         max:                                 6774.52
         95th percentile:                     1739.68
         sum:                              1204235.67

Threads fairness:
    events (avg/stddev):           88.9000/5.19
    execution time (avg/stddev):   120.4236/0.40

sysbench 1.0.19 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 10
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 10 tps: 3.60 qps: 86.57 (r/w/o: 62.58/8.00/15.99) lat (ms,95%): 6713.97 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 10 tps: 8.30 qps: 159.20 (r/w/o: 110.70/16.20/32.30) lat (ms,95%): 1561.52 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 10 tps: 8.40 qps: 169.49 (r/w/o: 118.10/18.90/32.50) lat (ms,95%): 1352.03 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 10 tps: 7.80 qps: 156.70 (r/w/o: 110.20/16.20/30.30) lat (ms,95%): 1506.29 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 10 tps: 7.70 qps: 158.31 (r/w/o: 112.11/16.30/29.90) lat (ms,95%): 1708.63 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 10 tps: 8.20 qps: 158.70 (r/w/o: 110.00/18.10/30.60) lat (ms,95%): 1453.01 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 10 tps: 7.60 qps: 148.49 (r/w/o: 103.39/18.60/26.50) lat (ms,95%): 1618.78 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 10 tps: 7.70 qps: 158.20 (r/w/o: 111.20/17.10/29.90) lat (ms,95%): 1453.01 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 10 tps: 7.40 qps: 146.11 (r/w/o: 102.11/17.10/26.90) lat (ms,95%): 2045.74 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 10 tps: 7.60 qps: 154.50 (r/w/o: 108.80/16.00/29.70) lat (ms,95%): 1506.29 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 10 tps: 7.60 qps: 149.80 (r/w/o: 104.20/16.70/28.90) lat (ms,95%): 1973.38 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 10 tps: 7.20 qps: 145.50 (r/w/o: 101.80/16.80/26.90) lat (ms,95%): 1739.68 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            12614
        write:                           1978
        other:                           3428
        total:                           18020
    transactions:                        901    (7.43 per sec.)
    queries:                             18020  (148.65 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          121.2205s
    total number of events:              901

Latency (ms):
         min:                                  949.79
         avg:                                 1339.01
         max:                                 6803.25
         95th percentile:                     1708.63
         sum:                              1206452.29

Threads fairness:
    events (avg/stddev):           90.1000/6.22
    execution time (avg/stddev):   120.6452/0.38